In [1]:
import numpy as np
import pandas as pd
import datetime
import re

In [2]:

df = pd.read_csv ('attacks_completo .csv')
df.sample(4)

,Unnamed: 0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,fatal_(y/n),injury,date
1043,1043,2010.01.30,2010.0,Unprovoked,BRAZIL,Rio Grande Do Sul,"Atlantis Beach, near Tramandai",Surfing,Andrei Johann,M,29,NaN,Thought to involve a juvenile hammerhead shark,N,Foot bitten,31-Jan-2010
3411,3411,1969.08.29,1969.0,Unprovoked,USA,Florida,"North Beach, St. Lucie County",Floating on his back,D.C. Barnes,M,NaN,Afternoon,NaN,N,Laceration to right leg,29-Aug-1969
4739,4739,1941.00.00.h,1941.0,Unprovoked,SOLOMON ISLANDS,New Georgia,Munda,Floating,male,M,NaN,NaN,NaN,N,Buttock bitten,1941
2257,2257,1997.01.20,1997.0,Unprovoked,AUSTRALIA,Western Australia,Geraldton,Windsurfing,Werner Schonhofer,M,41,18h00,"Tiger shark, 4.5 m [14'9""]",Y,"Presumed fatal, no body recovered, shark mutil...",20-Jan-1997

1. Cread una columna nueva y una funci√≥n que nos de el mes en el que ocurri√≥ el ataque. Tened en cuenta que no todas las filas tienen la misma estructura y que puede que no haya la informaci√≥n de mes. En ese caso devolved un nulo (NaN).
üí° Pista üí°Pod√©is usar regex.

In [3]:
df['date'].values

array(['25-Jun-2018', '18-Jun-2018', '09-Jun-2018', ..., '1900-1905',
       '1883-1889', '1845-1853'], dtype=object)

In [4]:
#nos aseguramos de que tipo son los valores de la columna para ver si se puede hacer con datetime
x= df['date'][0]
x
type(x)

str

In [5]:
#como son strings la soluci√≥n es usar regex y definimos el patron. Para mayor seguridad hacemos un patron
#en el que nos capture todo lo que est√° entre guiones
patron= '-\D{3}-'

In [6]:
#definimos la funci√≥n y la comprobamos para luego aplicar a toda la columna
def dime_mes (col):
    try:
        x= re.findall ('-\D{3}-', col)
        for i in x:
            y= i.replace ('-', '')
        return y
    except:
        return np.nan

In [7]:
#y la comprobamos 
dime_mes (df['date'][1])

'Jun'

In [8]:
dime_mes ('1900-1905')

nan

In [9]:
#aplicamos y creamos nueva columna
df['mes'] =df['date'].apply(dime_mes)

In [10]:
df.tail(1)

,Unnamed: 0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,fatal_(y/n),injury,date,mes
6283,6283,ND.0001,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,NaN,NaN,Y,"FATAL. ""Shark bit him in half, carrying away t...",1845-1853,NaN

In [11]:
df.head(1)

,Unnamed: 0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,fatal_(y/n),injury,date,mes
0,0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018,Jun

In [12]:
df['mes'].unique()

array(['Jun', 'May', nan, 'Apr', 'Mar', 'Feb', 'Jan', 'Dec', 'Nov', 'Oct',
       'Sep', 'Aug', 'Jul'], dtype=object)

2. Vamos con la columna fatal_(y/n). Lo primero que ten√©is que hacer es evaluar los valores √∫nicos que hay. Esperar√≠amos tener solo dos valores: y y n, pero tristemente no ser√° as√≠ üò≠. Cread una columna nueva y una funci√≥n que devuelva √∫nicamente y o n y que devuelva un nulo (NaN) si no se encuentra el valor.

In [13]:
df['fatal_(y/n)'].unique()

array(['N', 'Y', nan, 'M', 'UNKNOWN', '2017', ' N', 'N ', 'y'],
      dtype=object)

In [14]:
#definimos y comprobamos la funcion
def si_no (col):
    if col=='Y'or col=='y':
        return 'y'
    elif col== 'N'or col=='n':
        return 'n'
    else:
        return np.nan

In [15]:
si_no (df['fatal_(y/n)'][1])

'n'

In [16]:
si_no (df['fatal_(y/n)'][205])

nan

In [17]:
#creamos nueva columnas
df['fatal2'] = df['fatal_(y/n)'].apply (si_no)

In [18]:
df.head(1)

,Unnamed: 0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,fatal_(y/n),injury,date,mes,fatal2
0,0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018,Jun,n

3. Seguid la misma l√≥gica que en el ejercicio anterior pero con la columna sex. Pero en este caso vamos a incluir un retito m√°s: En este caso querremos tener dos valores √∫nicos F y M. De nuevo en la columna hay otros car√°cteres raros como 'M ', 'lli', 'N', '.'. En esos casos, queremos que se reemplacen por M o F de forma aleatoria (tendr√©is que usar la librer√≠a random). En caso de que sea nulo, que la funci√≥n devuelva nulo (np.nan).

In [19]:
df['sex_'].unique()

array(['F', 'M', nan, 'M ', 'lli', 'N', '.'], dtype=object)

In [20]:
def sexo (col):
    if col=='F' or col=='f':
        return 'F'
    elif col=='M' or col=='m':
        return 'M'
    elif col== 'nan':
        return np.nan

In [23]:
df['sexo'] =df['sex_'].apply(sexo)

4. Una vez que hay√°is terminado eliminad las columnas originales conservando las nuevas.

In [21]:
df_nuevo_ataques= df.drop (columns= ['fatal_(y/n)', 'sex_', 'date'] )

5. Guardad el dataframe en un csv que usaremos m√°s adelante

In [22]:
df_nuevo_ataques.to_csv('nuevo_ataques.csv')